wisteria-1c/Конфигурация/DataProcessors/НастройкаЗаполненияДатыОтгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>НастройкаЗаполненияДатыОтгрузки</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

wisteria-1c/Конфигурация/Enums/ВариантыЗаполненияДатыОтгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВариантыЗаполненияДатыОтгрузки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеЗаполнять</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прибавлять</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

wisteria-1c/Конфигурация/Enums/ВидыДнейРасчетаДатыОтгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыДнейРасчетаДатыОтгрузки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Календарные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рабочие</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

wisteria-1c/Конфигурация/DataProcessors/НастройкаЗаполненияДатыОтгрузки/Forms/ФормаНастроек/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоНастройкаПоДоговору = Параметры.Свойство("ДоговорКонтрагента");
	
	УстановитьЗаголовокПояснения();
	ЗаполнитьРеквизитыФормы();
	НастроитьОтображениеФормы();
		
	Если ЭтоНастройкаПоДоговору Тогда
		
		Сообщение = Новый Массив();
		Сообщение.Добавить(НСтр("ru = 'Значения по умолчанию можно задать в '"));
		Сообщение.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'настройках программы'"), , , , "НастройкиПрограммы"));
		ТекстСообщения = Новый ФорматированнаяСтрока(Сообщение);
		
		ПараметрыСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
		ПараметрыСообщения.ТипСообщения = "Информация";
		ПараметрыСообщения.Сообщение = ТекстСообщения;
		ПараметрыСообщения.КраткоеПредставление = НСтр("ru = 'Значения по умолчанию'");
		ПараметрыСообщения.Обработчик = "ДекорацияИнформацияПоНастройкамОбработкаНавигационнойСсылки";
		ПараметрыСообщения.Скрываемый = Истина;
	
		ОбщегоНазначения.ДобавитьВажноеСообщение(ЭтотОбъект, ПараметрыСообщения);
		
	КонецЕсли;
	
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВариантЗаполненияДатыОтгрузкиПриИзменении(Элемент)
	
	Если ВариантЗаполненияДатыОтгрузки =
			ПредопределенноеЗначение("Перечисление.ВариантыЗаполненияДатыОтгрузки.Прибавлять") Тогда
		Элементы.ГруппаСрок.Видимость = Истина;
		Если НЕ ЗначениеЗаполнено(ВидДнейРасчетаДатыОтгрузки) Тогда
			ВидДнейРасчетаДатыОтгрузки = ПредопределенноеЗначение("Перечисление.ВидыДнейРасчетаДатыОтгрузки.Календарные");
		КонецЕсли;
		Элементы.ГруппаПроизводственныйКалендарь.Видимость =
			(ВидДнейРасчетаДатыОтгрузки = ПредопределенноеЗначение("Перечисление.ВидыДнейРасчетаДатыОтгрузки.Рабочие"));
	Иначе
		Элементы.ГруппаСрок.Видимость = Ложь;
		Элементы.ГруппаПроизводственныйКалендарь.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоДнейПриИзменении(Элемент)
	
	УстановитьТекстДекорацииДней();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДнейПриИзменении(Элемент)
	
	Если ВидДнейРасчетаДатыОтгрузки = ПредопределенноеЗначение("Перечисление.ВидыДнейРасчетаДатыОтгрузки.Рабочие") Тогда 
		ВидимостьКалендаря = Истина
	Иначе
		ВидимостьКалендаря = Ложь
	КонецЕсли;
	Элементы.ГруппаПроизводственныйКалендарь.Видимость = ВидимостьКалендаря;

КонецПроцедуры	

&НаКлиенте
Процедура ДекорацияИнформацияПоНастройкамОбработкаНавигационнойСсылки(Элемент,
				НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("СтрокаПоиска", НСтр("ru='заполнение даты отгрузки'"));
	ОткрытьФорму("Обработка.НастройкаПрограммы.Форма.НастройкаПрограммы", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Если ВариантЗаполненияДатыОтгрузки = 
			ПредопределенноеЗначение("Перечисление.ВариантыЗаполненияДатыОтгрузки.Прибавлять")
			И ВидДнейРасчетаДатыОтгрузки = ПредопределенноеЗначение("Перечисление.ВидыДнейРасчетаДатыОтгрузки.Рабочие")
			И ПроизводственныйКалендарьРасчетаДатыОтгрузки.Пустая() Тогда
			
		ТекстПредупреждения = НСтр("ru='Не выбран производственный календарь'");
		ПоказатьПредупреждение(,ТекстПредупреждения);
		Возврат;
		
	КонецЕсли;
	
	Результат = ПараметрыЗакрытия();
	Закрыть(Результат);

КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьНастройкиПоУмолчанию(Команда)
	
	ЗаполнитьРеквизитыФормы(Истина);
	НастроитьОтображениеФормы();
	ПоказатьОповещениеПользователя(, , НСтр("ru='Восстановлены настройки по умолчанию'"), ,
		СтатусОповещенияПользователя.Информация);	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьЗаголовокПояснения()
	
	Если ЭтоНастройкаПоДоговору Тогда
		ТекстСтроки = НСтр("ru='Как нужно заполнять дату отгрузки в новых заказах покупателя по договору %1?'");
		ТекстЗаголовка = СтрШаблон(ТекстСтроки, Параметры.ДоговорКонтрагента.Наименование);
	Иначе
		ТекстЗаголовка = НСтр("ru='Как нужно заполнять настройку даты отгрузки в новых договорах контрагентов?'");
	КонецЕсли;
	
	Элементы.ДекорацияЗаголовокДатыОтгрузки.Заголовок = ТекстЗаголовка;
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьРеквизитыФормы(ПоУмолчанию = Ложь)
	
	СписокСвойств = Обработки.НастройкаЗаполненияДатыОтгрузки.СписокНастроекДатыОтгрузки();
	
	Если ЭтоНастройкаПоДоговору И НЕ ПоУмолчанию Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры.ДоговорКонтрагента, СписокСвойств);
		
	Иначе
		
		НаборКонстант = Константы.СоздатьНабор(СписокСвойств);
		НаборКонстант.Прочитать(); 
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, НаборКонстант);
		
	КонецЕсли;
	
	Если ВариантЗаполненияДатыОтгрузки.Пустая() Тогда
		ВариантЗаполненияДатыОтгрузки = Перечисления.ВариантыЗаполненияДатыОтгрузки.НеЗаполнять;
		ВидДнейРасчетаДатыОтгрузки = Перечисления.ВидыДнейРасчетаДатыОтгрузки.Календарные;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьОтображениеФормы()
		
	Если ВариантЗаполненияДатыОтгрузки = 
			ПредопределенноеЗначение("Перечисление.ВариантыЗаполненияДатыОтгрузки.Прибавлять") Тогда
		Элементы.ГруппаСрок.Видимость = Истина;
		Если НЕ ЗначениеЗаполнено(ВидДнейРасчетаДатыОтгрузки) Тогда
			ВидДнейРасчетаДатыОтгрузки = ПредопределенноеЗначение("Перечисление.ВидыДнейРасчетаДатыОтгрузки.Календарные");
		КонецЕсли;
		Элементы.ГруппаПроизводственныйКалендарь.Видимость =
			(ВидДнейРасчетаДатыОтгрузки = ПредопределенноеЗначение("Перечисление.ВидыДнейРасчетаДатыОтгрузки.Рабочие"));
	Иначе
		Элементы.ГруппаСрок.Видимость = Ложь;
		Элементы.ГруппаПроизводственныйКалендарь.Видимость = Ложь;
	КонецЕсли;

	Если НЕ ЭтоНастройкаПоДоговору Тогда
		Элементы.ФормаВосстановитьНастройкиПоУмолчанию.Видимость = Ложь;
	КонецЕсли;

	УстановитьТекстДекорацииДней();

КонецПроцедуры

&НаСервере
Процедура УстановитьТекстДекорацииДней()
	
	КалендарныйДень = НСтр("ru='календарный день'");
	ПолнаяСтрокаКалендарные = ПолучитьСклоненияСтрокиПоЧислу(КалендарныйДень, КоличествоДнейРасчетаДатыОтгрузки,,
		"ЧС=Количественное", "ПД=Именительный");
	МассивСтрок = СтрРазделить(ПолнаяСтрокаКалендарные[0], " ");                                                                                      
	Календарные = НРег(МассивСтрок[МассивСтрок.Количество() - 2]);

	РабочийДень = НСтр("ru='рабочий день'"); 
	ПолнаяСтрокаРабочие = ПолучитьСклоненияСтрокиПоЧислу(РабочийДень, КоличествоДнейРасчетаДатыОтгрузки,,
		"ЧС=Количественное", "ПД=Именительный");
	МассивСтрок = СтрРазделить(ПолнаяСтрокаРабочие[0], " ");
	Рабочие = НРег(МассивСтрок[МассивСтрок.Количество() - 2]);
	                                                                 
	СтрокаДней = НРег(МассивСтрок[МассивСтрок.Количество() - 1]);

	Элементы.ВидДней.СписокВыбора.Очистить();
	Элементы.ВидДней.СписокВыбора.Добавить(Перечисления.ВидыДнейРасчетаДатыОтгрузки.Календарные, Календарные);
	Элементы.ВидДней.СписокВыбора.Добавить(Перечисления.ВидыДнейРасчетаДатыОтгрузки.Рабочие, Рабочие);
	                                                 
	СтрокаЗаголовка = НСтр("ru='%1 к дате документа'");
	Элементы.ДекорацияДней.Заголовок = СтрШаблон(СтрокаЗаголовка, СтрокаДней); 	

КонецПроцедуры

&НаСервере
Функция ПараметрыЗакрытия()
	
	Результат = Обработки.НастройкаЗаполненияДатыОтгрузки.СтруктураНастроекДатыОтгрузки();
	ЗаполнитьЗначенияСвойств(Результат, ЭтотОбъект);	
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
